tap "amar1729/deluge-meta"
tap "nikitabobko/tap"
# Code searching, linting, rewriting
brew "ast-grep"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Optimizer for PNG files
brew "pngcrush"
# Multi-purpose desktop calculator
brew "qalculate-gtk"
# File browser
brew "ranger"
# Tools for file renaming
brew "renameutils"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Meta package for Deluge 2.0 dependencies
brew "amar1729/deluge-meta/deluge-meta"
# Create and modify subtitles
cask "aegisub"
# GPU-accelerated terminal emulator
cask "alacritty"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Mount network shares quick and easy
cask "connectmenow"
# Voice and text chat software
cask "discord"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Online diagram software
cask "drawio"
# Excalidraw client
cask "excalidrawz"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# IRC client
cask "halloy"
# Open-source video transcoder
cask "handbrake-app"
# Game launcher
cask "heroic"
# Hex editor focussing on speed
cask "hex-fiend"
# Vector graphics editor
cask "inkscape"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Free and Open Source Video Editor
cask "kdenlive"
# Password manager app
cask "keepassxc"
# Free and open-source painting and sketching program
cask "krita"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# GameStream client
cask "moonlight"
# Free and open-source RSS reader
cask "netnewswire"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Document editor
cask "onlyoffice"
# Podcast platform
cask "pocket-casts"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Multi platform Twitch.tv browser for Streamlink
cask "streamlink-twitch-gui"
# Real time file synchronisation software
cask "syncthing-app"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Customizable email client
cask "thunderbird"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Connect to Windows
cask "windows-app"
# Network protocol analyzer
cask "wireshark-app"
# Handwriting notetaking software
cask "xournal++"
# Free and open source web app scanner
cask "zap"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
# Video communication and virtual meeting platform
cask "zoom"
vscode "bmewburn.vscode-intelephense-client"
vscode "dbaeumer.vscode-eslint"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-pull-request-github"
vscode "kde.breeze"
vscode "mikebovenlander.formate"
vscode "mrcrowl.easy-less"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "mushan.vscode-paste-image"
vscode "nacholaciar.tokyo-midnight"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "simonguo.vscode-markdown-table-sort"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
